Catalogs/ДанныеСотрудникаВPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДанныеСотрудникаВPDM</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Enabled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Username</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омЗапросыПДМ/Ext/Module.bsl
&НаСервере
Функция ПолучитьДанныеСотрудникаИзПДМ(Сотрудник) Экспорт
	
	стВозврата = Новый Структура("UserID, EnabledPDM, Username", 0, Ложь, "");
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат стВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСотрудникаВPDM.UserID КАК UserID,
		|	ДанныеСотрудникаВPDM.Enabled КАК EnabledPDM,
		|	ДанныеСотрудникаВPDM.Username КАК Username
		|ИЗ
		|	Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
		|ГДЕ
		|	ДанныеСотрудникаВPDM.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла;
	
	Возврат стВозврата; 
КонецФункции // ПолучитьДанныеСотрудникаИзПДМ()
